#!/usr/bin/env python
# @Time : 2019/3/24 13:04 
__author__ = 'Boaz'

# version 3.6.2
A0 = dict(zip(('a','b','c','d','e'),(1,2,3,4,5)))   # {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
A1 = range(10)    # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
A2 = [i for i in A1 if i in A0] # []
A3 = [A0[s] for s in A0]
A4 = [i for i in A1 if i in A3]
A5 = {i:i*i for i in A1}
A6 = [[i,i*i] for i in A1]

'''
A0  --->  {'a':1,'b':2,'c':3,'d':4,'e':5}
A1  --->  [0,1,2,3,4,5,6,7,8,9]
A2  --->  [1,2,3,4,5]
A3  --->  [1,2,3,4,5] ???
A4  --->  [1,2,3,4,5]
A5  --->  {1:1,2:4:3:9 .... 9:81}   # 顺序不一定一样
A6  --->  [[1,1],.....[9:81]]
'''

#　总结。你对dictionary这个模式是不是有什么误解啊？　真的是醉了。。。。。。。。。。
# 感情 dictionary这个东西你想访问就能够访问一样